var cont = ["<span class='con-h1'><strong>История</strong></span><span class='con-p-span'><p class='con-p'>Согласно самой распространённой легенде [источник не указан 596 дней], тонизирующие свойства кофе были открыты эфиопским пастухом по имени Калди, заметившим, что его козы, наевшись днем плотных листьев и темно-красных плодов кофейного дерева, начинают вести себя по ночам возбуждённо безо всякой очевидной причины. Он рассказал об этом странном случае настоятелю монастыря, и тот решил испробовать на себе действие необычных зёрен.</p><div class='imgdiv'><img class='img' src='images/1.jpg' alt='Фото кофе'></div><p class='con-p'>Настоятель был поражён силой воздействия напитка и, дабы поддержать бодрость монахов, засыпавших во время ночных молебнов, повелел им пить этот отвар. Впоследствии монахи научились обжаривать и молоть зёрна.</p><p class='con-p'>Первоначально в качестве тонизирующего средства употреблялся не отвар обжаренных зёрен, а непосредственно сырые кофейные ягоды. Чуть позже в Йемене начали готовить напиток из зрелой высушенной мякоти кофейного плода, получая напиток — «гешир» (он же кишр) — так называемый «белый йеменский кофе».</p><p class='con-p'>Эфиопы были окончательно изгнаны с территории Аравийского полуострова в XI веке. За время их правления арабы переняли многое из самобытной и богатой культуры эфиопов, в том числе и привычку употреблять кофе. Вначале арабы готовили его способом, далёким от современного. Они давили кофейные зёрна и смешивали их с животным жиром и молоком. Из получившейся массы делали шарики, которые брали с собой в дорогу в качестве общеукрепляющего средства.</p><p class='con-p'>Лишь в XII веке из сырых кофейных зёрен стали готовить напиток, а ещё столетия спустя начали срывать плоды с кофейных деревьев, сушить зёрна, обжаривать и измельчать, а получившийся порошок заливать горячей водой. Арабы добавляли в него различные пряности — имбирь, корицу. Также смешивали напиток с молоком.</p><div class='imgdiv flo-r'><img class='img' src='images/4.jpg' alt='Кофейные зёрна'></div><p class='con-p'>До XIV века кофе произрастал в Эфиопии в диком виде. После кофейное дерево было привезено на Аравийский полуостров. В XVI веке стал широко распространяться в Османской империи. В конце XVI века европейские торговцы начали закупать кофе в арабских портах и привозить в Европу. Согласно легенде, в середине XVII века мусульманский пилигрим тайно вывез кофейные зёрна в Южную Индию. Оттуда в конце XVII века голландские торговцы тайно вывезли кофейное дерево на Яву и Суматру. Это послужило концом арабской монополии на выращивание кофе.</p><p class='con-p'>В Константинополе около 1555 года была открыта первая публичная кофейня. Историки утверждают, что всемогущий визирь Мехмед Кёпрюлю однажды переоделся простолюдином и отправился по кофейням, чтобы послушать, что говорят о власти. И, как оказалось, не услышал ни одного доброго слова, после чего царедворец велел закрыть все кофейни, а кофе запретить.</p><p class='con-p'>В Англии кофейни долгое время считались мужскими клубами, и в 1674 году женщины, недовольные тем, что мужей не вытащить из кофеен, написали «Женскую петицию против кофе».</p><p class='con-p'>Согласно легенде, широкое распространение кофе в Европе связано с именем купца и бывшего запорожского казака Юрия-Франца Кульчицкого, который в 1683 году после победы Австрии в Венской битве открыл этот напиток австрийцам. Первую кофейню Кульчицкий якобы открыл в собственном доме, который ему предоставили в качестве вознаграждения за победу над османским войском, в 1686 году. Современные[кому?] историки считают, что первую кофейню в Вене и в целом в Европе открыл в 1685 году армянин Ованес Аствацатур (известный в Европе как Йоханес Диодато).</p><p class='con-p'>В 1706 году голландские колонисты прислали саженец кофейного дерева в ботанический сад Амстердама, и с этого дерева началось выращивание растения в колониях Нового Света. Через несколько лет французский король получает в подарок саженец дерева от голландцев, и вскоре французы вывозят сорта мокко из Йемена на о. Бурбон (ныне — Реюньон, рядом с островом Мадагаскар). Так началась история известного сорта арабики, называемого «бурбон».</p><p class='con-p'>В 1721 году закладываются плантации в Гвиане и на Мартинике. В 1727 — в Бразилии, в 1730 году — на Ямайке (начало знаменитого сорта Blue Mountain), 1748 год — на Кубе, 1760 — в Гватемале, 1779 — в Коста-Рике.</p><div class='imgdiv'><img class='img' src='images/3.jpg' alt='История'></div><p class='con-p'>В России кофе оказался при царе Алексее Михайловиче и служил средством от многих болезней, в том числе от мигрени. Однако именно обычай пить кофе связывают с именем Петра I. Он, по утверждениям историков, насильно поил «горьким пойлом» приближённых. В 1703 году был открыт первый кофейный дом.</p><p class='con-p'>В XVIII веке европейцы завезли саженцы кофейного дерева во многие тропические страны по всему миру. Кофе выращивается в 65 странах. Больше всего кофе производится в Бразилии (на её долю приходится около 40 % мирового производства кофе), Колумбии, Вьетнаме, Индонезии, Мексике, Индии и Эфиопии.</p><p class='con-p'>Растворимый кофе был изобретён и запатентован (патент № 3518) Дэвидом Стренгом из Новой Зеландии.</p><p class='con-p'>Декофеинизирование кофейных зерен было изобретено в 1903 году немцем Людвигом Розелиусом. Сделать это открытие ему помог случай. Судно, перевозившее груз кофе, попало в сильный шторм, и трюмы были залиты морской водой до такой степени, что корабль с трудом оставался на плаву. Хозяин груза думал, что всё пропало, но на всякий случай решил отнести кофейные зерна на экспертизу. Эксперт Людвиг Розелиус определил, что кофе в полном порядке, но потерял почти весь кофеин. Впоследствии удачливый немец запатентовал в США свою находку. Широкая известность к кофе без кофеина пришла в 1930 году.</p></span>",
"",
"<span class='con-h1'>Виды обжарки кофе</span><p class='con-p'>Степень обжарки зерен оказывает самое серьезное влияние на вкус готового напитка. Поэтому различают несколько видов кофе по степени обжарки.</p><span class='con-h2'>Обжарка начальной степени</span><p class='con-p'>Чаще всего используется для зерен высокого качества, так как максимально сохраняет оригинальный аромат кофе и его вкусовые качества. Зерна при такой обжарке имеют светло-карамельный неравномерный цвет, небольшие трещины, матовую поверхность, практически, без маслянистого блеска.</p><span class='con-h2'>Слабая обжарка</span><p class='con-p'>Она придает более насыщенный цвет, помогает повысить крепость и снизить кислинку. Зерна светло-коричневые, с увеличенными трещинами, ровного цвета. Такая обжарка популярна в Америке и Скандинавии.</p><span class='con-h2'>Средняя обжарка</span><p class='con-p'>Очень популярный вариант в Средиземноморье. Часто используют для приготовления смесей для эспрессо. Зерна имеют насыщенный коричневый цвет, маслянистый контур. Крепость кофе, приготовленного из таких зерен, будет выше, а его вкус будет отмечен слабой кислинкой.</p><span class='con-h2'>Сильная обжарка</span><p class='con-p'>Зерна становятся темно-коричневыми, маслянистыми, кислотность, с выраженными трещинами. При такой обжарке кислотность кофе практически, исчезает, зато появляется легкий карамельный аромат. Ярче становятся и горьковатые ноты. Напиток получается очень крепким.</p><center><div class='imgdiv-l'><img src='images/6.jpg' alt='' class='img-l'></div></center><p class='con-p'>Чем сильнее обжарка, тем труднее различить оригинальный вкус и аромат зерна, поэтому низкосортные смеси всегда подвергаются сильной термообработке. Легкая и средняя обжарка характерна для кенийского, эфиопского, никарагуанского кофе. Как правило, их заваривают в турке, френч-прессе или просто в чашке, без использования кофе-машин.</p><p class='con-p'>А вот эспрессо и напитки из него готовят из специальных смесей сильной обжарки.</p><p class='con-p'>Обилие видов кофе обеспечивают любителям этого напитка не только приятное вкусовое разнообразие, но и возможность проявить собственную фантазию в выборе зерен, составлении собственных смесей и дегустации различных рецептов.</p>"
];
function ComePage1() {
    $('#content').html(cont[0]);
};
function ComePage2() {
    $("#content").html(cont[1]);
    karusel.start();
}
function ComePage3() {
    $("#content").html(cont[2]);
}
window.onload = function() {
//     ComePage1();
    karusel.start();
}

var karusel = {
    slides: ['images/1.1.jpg', 'images/1.2.jpg', 'images/1.3.jpg', 'images/1.4.jpg', 'images/1.5.jpg', 'images/1.6.jpg', 'images/1.7.jpg', 'images/1.8.jpg', 'images/1.9.jpg', 'images/1.10.jpg', 'images/1.11.jpg'],
    kadr: 0,
    set: function(image){
        $("#karusel").html("<img class='img-l' src="+this.slides[this.kadr]+"></img>");
    },
    start: function() {
        this.set(this.slides[this.kadr]);
        setInterval(function (){karusel.list()}, 2000, "slow");
    },
    list: function() {
        this.kadr++;
        if (this.kadr == 10) this.kadr = 0;
        this.set(this.slides[this.kadr]);
    }
}

$(window).load(function(){
    $('a[href*=#]').click(function(event){
        var bot = $('a[name="'+this.href.split("#")[1]+'"]').offset().top;
        $('html, body').animate({scrollTop:bot}, 'slow');
    });
});

function expMenu() {
    var name = document.getElementById("menuS").className;
    var nameDiv;
    if (name == "menu") {
        name = "circle";
        nameDiv = "elmenuC";
    }
    else {
        name = "menu";
        nameDiv = "elmenu";
    }
    if (nameDiv == "elmenu"){
        document.getElementById("menuS").className = name;
        setTimeout(function (){document.getElementById("page1").className = nameDiv}, 350);
        setTimeout(function (){document.getElementById("page2").className = nameDiv}, 350);
        setTimeout(function (){document.getElementById("page3").className = nameDiv}, 350);
        document.getElementById("icon").className = "icon";
    }
    else{
        document.getElementById("page1").className = nameDiv;
        document.getElementById("page2").className = nameDiv;
        document.getElementById("page3").className = nameDiv;
        document.getElementById("menuS").className = name;
        setTimeout(function (){document.getElementById("icon").className = "iconC"}, 1200);
    }
}
